Revit 2026 API

# RoundingMethod Enumeration

---

Rounding methods

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RoundingMethod
```
```vb
Public Enumeration RoundingMethod
```
```cpp
public enum class RoundingMethod
```
```fsharp
type RoundingMethod
```

| Member name | Value | Description |
| --- | --- | --- |
| Down | 2 | Round Down |
| Nearest | 0 | Standard rounding: Round to Nearest |
| Up | 1 | Round Up |

#### Reference

Autodesk.Revit.DB Namespace